
Перем ОтображатьИнформациюАвтора Экспорт;

#Область СведенияОВнешнемОтчете

Функция СведенияОВнешнейОбработке() Экспорт 
	
	РегистрационныеДанные = Новый Структура;
	РегистрационныеДанные.Вставить("Наименование", "Просмотр и анализ журнала регистрации");
	РегистрационныеДанные.Вставить("БезопасныйРежим", Ложь);
	РегистрационныеДанные.Вставить("Версия", "3.0.0");
	РегистрационныеДанные.Вставить("ВерсияБСП", "");
	РегистрационныеДанные.Вставить("Вид", "ДополнительныйОтчет");
	РегистрационныеДанные.Вставить("Информация", 
		"Отчет ""Просмотр и анализ журнала регистрации"" предразначен для получения данных из журнала регистрации с возможностью 
		|их просмотра и обработки в системе компоновки данных (СКД). Последнее позволяет строить отчеты любой сложности по ЖР." +
		
		?(ОтображатьИнформациюАвтора = Истина,
		"|
		|Автор: YPermitin (ypermitin@yandex.ru)
		|Сайт:  github.com/YPermitin",
		""));
		
	МассивНазначенийОбработки = НазначениеОбработки();
	РегистрационныеДанные.Вставить("Назначение", МассивНазначенийОбработки);
	
	ТаблицаКомандОбработки = ТаблицаКомандОбработки();
	РегистрационныеДанные.Вставить("Команды", ТаблицаКомандОбработки);
		
	Возврат РегистрационныеДанные;
	
КонецФункции

Функция НазначениеОбработки() Экспорт 
	
	МассивНазначенийОбработки = Новый Массив;
	 
	Возврат МассивНазначенийОбработки;
	
КонецФункции

Функция ТаблицаКомандОбработки() Экспорт 
	
	тзКоманд = Новый ТаблицаЗначений;
	тзКоманд.Колонки.Добавить("Идентификатор"           , Новый ОписаниеТипов("Строка"));
	тзКоманд.Колонки.Добавить("Представление"           , Новый ОписаниеТипов("Строка"));
	тзКоманд.Колонки.Добавить("ПоказыватьОповещение"    , Новый ОписаниеТипов("Булево"));
	тзКоманд.Колонки.Добавить("Модификатор"             , Новый ОписаниеТипов("Строка"));
	тзКоманд.Колонки.Добавить("Использование"           , Новый ОписаниеТипов("Строка"));
	тзКоманд.Колонки.Добавить("Скрыть"                  , Новый ОписаниеТипов("Булево"));
	
	ДобавитьКоманду(тзКоманд, "ПросмотрИАнализЖурналаРегистрации", "Просмотр и анализ журнала регистрации", Ложь, "ОткрытиеФормы", "", Ложь);
	
	Возврат тзКоманд;
	
КонецФункции

Процедура ДобавитьКоманду(ТаблицаКоманд, Идентификатор, Представление, ПоказыватьОповещение, Использование, Модификатор, Скрыть)
	
	строкаКоманды = ТаблицаКоманд.Добавить();
	строкаКоманды.Идентификатор = Идентификатор;
	строкаКоманды.Представление = Представление;
	строкаКоманды.ПоказыватьОповещение = ПоказыватьОповещение;
	строкаКоманды.Использование = Использование;
	строкаКоманды.Модификатор = Модификатор;
	строкаКоманды.Скрыть = Скрыть;
	
КонецПроцедуры

Процедура ВыполнитьКоманду(ИдентификаторКоманды, ПараметрыВыполненияКоманды = Неопределено) Экспорт
	
КонецПроцедуры

#КонецОбласти

#Область БиблиотекаСтандартныхПодсистем

Функция ИспользуетсяБСП()
	
	ИспользуетсяБСП = Ложь;
	
	ОбщийМодульБСП = ОбщийМодуль("СтандартныеПодсистемыСервер");
	Если ОбщийМодульБСП <> Неопределено Тогда
		
		Попытка
			ВерсияБиблиотеки = ОбщийМодульБСП.ВерсияБиблиотеки();
			ИспользуетсяБСП = Истина;
		Исключение
			ИспользуетсяБСП = Ложь;	
		КонецПопытки;
		
	КонецЕсли;
		
	Возврат ИспользуетсяБСП;
	
КонецФункции

#КонецОбласти

#Область Инициализация

Процедура Инициализация() Экспорт
	
	// Если флаг включен, то в отчете будут доступны команды для 
	// связи с автором отчета и перехода к онлайн-справке.
	// При встраивании в конфигурацию эту информацию можно скрыть, установив
	// флаг в значение ЛОЖЬ
	ОтображатьИнформациюАвтора = Истина;
	
	ЭтотОбъект.ИспользуетсяБСП = ИспользуетсяБСП();	
	ИнициализацияДоступныхЗначенийОтборовЖурналаРегистрации();	
	ИнициализацияНачальныхЗначенийОтбораЖурналаРегистрации();
	
КонецПроцедуры

Процедура ИнициализацияНачальныхЗначенийОтбораЖурналаРегистрации()
	
	ТекущаяДата = ТекущаяДата();
	
	Если НЕ ЗначениеЗаполнено(ЭтотОбъект.НачалоПериода) Тогда
		ЭтотОбъект.НачалоПериода = НачалоДня(ТекущаяДата);
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ЭтотОбъект.КонецПериода) Тогда
		ЭтотОбъект.КонецПериода = КонецДня(ТекущаяДата);
	КонецЕсли;
	
	Если ЭтотОбъект.КолонкиЖурналаРегистрации.Количество() = 0 Тогда
		Для Каждого Эл Из ЭтотОбъект.КэшДоступныхЗначенийОтборов.КолонкиЖурналаРегистрации Цикл
			ЭтотОбъект.КолонкиЖурналаРегистрации.Добавить(Эл.Значение);
		КонецЦикла;
	КонецЕсли;
	
	ЭтотОбъект.КэшироватьДанные = Истина;
	
КонецПроцедуры

Процедура ИнициализацияДоступныхЗначенийОтборовЖурналаРегистрации(КомпоновщикНастроекДляЗаполнения = Неопределено) Экспорт

	КэшДоступныхЗначенийОтборов = ПолучитьДоступныеЗначенияОтборовЖурналаРегистрации();
	
	СоответствиеВажностиЖурналаРегистрации = Новый Соответствие;
	СоответствиеВажностиЖурналаРегистрации.Вставить("Ошибка", "Ошибка");
	СоответствиеВажностиЖурналаРегистрации.Вставить("Предупреждение", "Предупреждение");
	СоответствиеВажностиЖурналаРегистрации.Вставить("Информация", "Информация");
	СоответствиеВажностиЖурналаРегистрации.Вставить("Примечание", "Примечание");
	КэшДоступныхЗначенийОтборов.Вставить("Важность", СоответствиеВажностиЖурналаРегистрации);
	
	СоответствиеСтатусТранзакциииЖурналаРегистрации = Новый Соответствие;
	СоответствиеСтатусТранзакциииЖурналаРегистрации.Вставить("НетТранзакции", "Нет транзакции");
	СоответствиеСтатусТранзакциииЖурналаРегистрации.Вставить("Зафиксирована", "Зафиксирована");
	СоответствиеСтатусТранзакциииЖурналаРегистрации.Вставить("НеЗавершена", "Не завершена");
	СоответствиеСтатусТранзакциииЖурналаРегистрации.Вставить("Отменена", "Отменена");
	КэшДоступныхЗначенийОтборов.Вставить("СтатусТранзакции", СоответствиеСтатусТранзакциииЖурналаРегистрации);
	
	СписокДоступныхКолонокЖурналаРегистрации = Новый СписокЗначений;
	СписокДоступныхКолонокЖурналаРегистрации.Добавить("Уровень");
	СписокДоступныхКолонокЖурналаРегистрации.Добавить("Дата");
	СписокДоступныхКолонокЖурналаРегистрации.Добавить("Пользователь");
	СписокДоступныхКолонокЖурналаРегистрации.Добавить("Компьютер");
	СписокДоступныхКолонокЖурналаРегистрации.Добавить("ИмяПриложения");
	СписокДоступныхКолонокЖурналаРегистрации.Добавить("Событие");
	СписокДоступныхКолонокЖурналаРегистрации.Добавить("Комментарий");
	СписокДоступныхКолонокЖурналаРегистрации.Добавить("Метаданные");
	СписокДоступныхКолонокЖурналаРегистрации.Добавить("Данные");
	СписокДоступныхКолонокЖурналаРегистрации.Добавить("ПредставлениеДанных");
	СписокДоступныхКолонокЖурналаРегистрации.Добавить("ИмяПользователя");
	СписокДоступныхКолонокЖурналаРегистрации.Добавить("ПредставлениеПриложения");
	СписокДоступныхКолонокЖурналаРегистрации.Добавить("ПредставлениеСобытия");
	СписокДоступныхКолонокЖурналаРегистрации.Добавить("ПредставлениеМетаданных");
	СписокДоступныхКолонокЖурналаРегистрации.Добавить("СтатусТранзакции");
	СписокДоступныхКолонокЖурналаРегистрации.Добавить("Транзакция");
	СписокДоступныхКолонокЖурналаРегистрации.Добавить("Сеанс");
	СписокДоступныхКолонокЖурналаРегистрации.Добавить("Соединение");
	СписокДоступныхКолонокЖурналаРегистрации.Добавить("РабочийСервер");
	СписокДоступныхКолонокЖурналаРегистрации.Добавить("ОсновнойIPПорт");
	СписокДоступныхКолонокЖурналаРегистрации.Добавить("ВспомогательныйIPПорт");
	КэшДоступныхЗначенийОтборов.Вставить("КолонкиЖурналаРегистрации", СписокДоступныхКолонокЖурналаРегистрации);
	
	СписокДоступныхУровнейЖурналаРегистрации = Новый СписокЗначений;
	СписокДоступныхУровнейЖурналаРегистрации.Добавить("Информация", "Информация");
	СписокДоступныхУровнейЖурналаРегистрации.Добавить("Ошибка", "Ошибка");
	СписокДоступныхУровнейЖурналаРегистрации.Добавить("Предупреждение", "Предупреждение");
	СписокДоступныхУровнейЖурналаРегистрации.Добавить("Примечание", "Примечание");
	КэшДоступныхЗначенийОтборов.Вставить("Уровень", СписокДоступныхУровнейЖурналаРегистрации);
		
	ОбновитьДоступныеЗначенияОтборов();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	ДатаНачалаВыполненияОперации = ТекущаяДата();
	
	СтандартнаяОбработка = Ложь;
	
	Настройки = КомпоновщикНастроек.ПолучитьНастройки();
	ЭлементыОтбора = Настройки.Отбор.Элементы;
	ЭлементыПараметры = Настройки.ПараметрыДанных.Элементы;
	ЭлементыПараметры.Найти("НачалоПериода").Значение = ЭтотОбъект.НачалоПериода;
	ЭлементыПараметры.Найти("КонецПериода").Значение = ЭтотОбъект.КонецПериода;
	
	Если НЕ ЭтотОбъект.КэшироватьДанные Тогда
		ЭтотОбъект.КэшЖурналаРегистрации.Очистить();	
	КонецЕсли;
	
	КолонкиСтрокой                       = "";		
	МаксимальноеКоличествоЗаписей 		 = ЭтотОбъект.МаксимальноеКоличествоЗаписей;
	ПоляЖурналаРегистрации               = ЭтотОбъект.КолонкиЖурналаРегистрации;
	
	Если НЕ РежимФормированияОтчета = "ТолькоФормированиеОтчета" Тогда
		ТабЖур = Новый ТаблицаЗначений;
		
		Фильтр = Новый Структура;
		Если ЗначениеЗаполнено(ЭтотОбъект.НачалоПериода) Тогда
			Фильтр.Вставить("ДатаНачала", ЭтотОбъект.НачалоПериода);
		КонецЕсли;
		Если ЗначениеЗаполнено(ЭтотОбъект.КонецПериода) Тогда
			Фильтр.Вставить("ДатаОкончания", ЭтотОбъект.КонецПериода);
		КонецЕсли;
		Если ЭтотОбъект.Важность.Количество() > 0 Тогда
			Фильтр.Вставить("Уровень", ЭтотОбъект.Важность.ВыгрузитьЗначения());	
		КонецЕсли;
		Если ЭтотОбъект.Приложения.Количество() > 0 Тогда
			Фильтр.Вставить("ИмяПриложения", ЭтотОбъект.Приложения.ВыгрузитьЗначения());	
		КонецЕсли;
		Если ЭтотОбъект.Пользователи.Количество() > 0 Тогда
			МассивПользователейОтбор = Новый Массив;
			Для Каждого Пользователь Из ЭтотОбъект.Пользователи Цикл
				МассивПользователейОтбор.Добавить(Пользователь.Представление);
			КонецЦикла;
			Фильтр.Вставить("Пользователь", МассивПользователейОтбор);	
		КонецЕсли;
		Если ЭтотОбъект.Компьютеры.Количество() > 0 Тогда
			Фильтр.Вставить("Компьютер", ЭтотОбъект.Компьютеры.ВыгрузитьЗначения());	
		КонецЕсли;
		Если ЭтотОбъект.События.Количество() > 0 Тогда
			Фильтр.Вставить("Событие", ЭтотОбъект.События.ВыгрузитьЗначения());	
		КонецЕсли;
		Если ЭтотОбъект.ФильтрМетаданные.Количество() > 0 Тогда
			Фильтр.Вставить("Метаданные", ЭтотОбъект.ФильтрМетаданные.ВыгрузитьЗначения());	
		КонецЕсли;
		Если ЗначениеЗаполнено(ЭтотОбъект.Данные) Тогда
			Фильтр.Вставить("Данные", ЭтотОбъект.Данные);	
		КонецЕсли;
		Если ЗначениеЗаполнено(ЭтотОбъект.ПредставлениеДанных) Тогда
			Фильтр.Вставить("ПредставлениеДанных", ЭтотОбъект.ПредставлениеДанных);	
		КонецЕсли;
		Если ЗначениеЗаполнено(ЭтотОбъект.Комментарий) Тогда
			Фильтр.Вставить("Комментарий", ЭтотОбъект.Комментарий);	
		КонецЕсли;
		Если ЗначениеЗаполнено(ЭтотОбъект.СтатусТранзакции) Тогда
			Фильтр.Вставить("СтатусТранзакции", ЭтотОбъект.СтатусТранзакции.ВыгрузитьЗначения());	
		КонецЕсли;
		Если ЗначениеЗаполнено(ЭтотОбъект.Транзакция) Тогда
			Фильтр.Вставить("Транзакция", ЭтотОбъект.Транзакция);
		КонецЕсли;
		Если ЭтотОбъект.Сеансы.Количество() > 0 Тогда
			Фильтр.Вставить("Сеанс", ЭтотОбъект.Сеансы.ВыгрузитьЗначения());	
		КонецЕсли;
		Если ЭтотОбъект.РабочиеСерверы.Количество() > 0 Тогда
			Фильтр.Вставить("РабочийСервер", ЭтотОбъект.РабочиеСерверы.ВыгрузитьЗначения());	
		КонецЕсли;
		Если ЭтотОбъект.ОсновныеIPПорты.Количество() > 0 Тогда
			Фильтр.Вставить("ОсновнойIPПорт", ЭтотОбъект.ОсновныеIPПорты.ВыгрузитьЗначения());	
		КонецЕсли;
		Если ЭтотОбъект.ВспомогательныеIPПорты.Количество() > 0 Тогда
			Фильтр.Вставить("ВспомогательныйIPПорт", ЭтотОбъект.ВспомогательныеIPПорты.ВыгрузитьЗначения());	
		КонецЕсли;
		
		ВыбраныВсеКолонкиЖурналаРегистрации = КолонкиЖурналаРегистрации.Количество() = 0
			ИЛИ КолонкиЖурналаРегистрации.Количество() = ЭтотОбъект.КэшДоступныхЗначенийОтборов.КолонкиЖурналаРегистрации.Количество();
		Если НЕ ВыбраныВсеКолонкиЖурналаРегистрации Тогда
			МассивПолейЖурналаРегистрации = Новый Массив;
			Для Каждого Стр Из ПоляЖурналаРегистрации Цикл
				Если ЗначениеЗаполнено(Стр.Значение) И МассивПолейЖурналаРегистрации.Найти(Стр.Значение) = Неопределено Тогда
					МассивПолейЖурналаРегистрации.Добавить(Стр.Значение);
				КонецЕсли;
			КонецЦикла;  		
			ВсегоПолей = МассивПолейЖурналаРегистрации.Количество();
			Для Каждого Стр Из МассивПолейЖурналаРегистрации Цикл
				КолонкиСтрокой = КолонкиСтрокой + Стр + ?(МассивПолейЖурналаРегистрации.Найти(Стр)<>ВсегоПолей-1,",","");
			КонецЦикла;
		КонецЕсли;
		
		Если ЭтотОбъект.КэшироватьДанные
			И ТипЗнч(ЭтотОбъект.КэшФильтраЖурналаРегистрации) = Тип("Структура") Тогда
			ЗначениеСтрНовыйФильтр = ЗначениеВСтрокуВнутр(Фильтр);
			ЗначениеСтрСтарыйФильтр = ЗначениеВСтрокуВнутр(ЭтотОбъект.КэшФильтраЖурналаРегистрации);
			ФильтрИзменился = ЗначениеСтрНовыйФильтр <> ЗначениеСтрСтарыйФильтр;
			
			Если (Фильтр.Свойство("ДатаОкончания") И Фильтр.ДатаОкончания > ТекущаяДата())
				ИЛИ НЕ Фильтр.Свойство("ДатаОкончания") Тогда
				ФильтрИзменился = Истина;	
			КонецЕсли;
			
		Иначе
			
			ФильтрИзменился = Истина;
			
		КонецЕсли;
		
		ИзменилсяСоставКолонок = ЭтотОбъект.КэшСоставаКолонок <> ЗначениеВСтрокуВнутр(КолонкиСтрокой); 
		ИзменилосьМаксимальноеКоличествоЗаписей = ЗначениеВСтрокуВнутр(МаксимальноеКоличествоЗаписей) <> ЭтотОбъект.КэшМаксимальноеКоличествоЗаписей; 
		
		Если ЭтотОбъект.КэшЖурналаРегистрации.Количество() = 0
			ИЛИ ФильтрИзменился
			ИЛИ ИзменилсяСоставКолонок
			ИЛИ ИзменилосьМаксимальноеКоличествоЗаписей Тогда
			
			ЭтотОбъект.КэшЖурналаРегистрации.Очистить();
			ЭтотОбъект.КэшФильтраЖурналаРегистрации = Фильтр;
			ЭтотОбъект.КэшСоставаКолонок = ЗначениеВСтрокуВнутр(КолонкиСтрокой);
			ЭтотОбъект.КэшМаксимальноеКоличествоЗаписей = ЗначениеВСтрокуВнутр(МаксимальноеКоличествоЗаписей);
			
			ПодготовленныйФильтрЖурналаРегистрации = ПодготовитьНастройкиФильтраДляПолученияДанныхЖурналарегистрации(Фильтр);
			ПолучитьДанныеЖурналаРегистрации(ТабЖур, ПодготовленныйФильтрЖурналаРегистрации, КолонкиСтрокой, МаксимальноеКоличествоЗаписей); 
			
			ДоступныеПоляПараметра = ЭтотОбъект.КэшДоступныхЗначенийОтборов.КолонкиЖурналаРегистрации;
			Для Каждого Стр Из ДоступныеПоляПараметра Цикл
				Если ТабЖур.Колонки.Найти(Стр.Значение) = Неопределено Тогда
					ТабЖур.Колонки.Добавить(Стр.Значение);	
				КонецЕсли;
			КонецЦикла;
			
			ТабЖур.Колонки.Добавить("МоментВремени");
			ТабЖур.Колонки.Добавить("ДанныеСтрокой");			
			НомерОбрабатываемойСтроки = 1;
			Для Каждого Стр Из ТабЖур Цикл
				Стр.Уровень = Строка(Стр.Уровень);
				Если Стр.СтатусТранзакции = СтатусТранзакцииЗаписиЖурналаРегистрации.Зафиксирована Тогда
					Стр.СтатусТранзакции = "Зафиксирована";
				ИначеЕсли Стр.СтатусТранзакции = СтатусТранзакцииЗаписиЖурналаРегистрации.НеЗавершена Тогда
					Стр.СтатусТранзакции = "НеЗавершена";
				ИначеЕсли Стр.СтатусТранзакции = СтатусТранзакцииЗаписиЖурналаРегистрации.НетТранзакции Тогда
					Стр.СтатусТранзакции = "НетТранзакции";
				ИначеЕсли Стр.СтатусТранзакции = СтатусТранзакцииЗаписиЖурналаРегистрации.Отменена Тогда
					Стр.СтатусТранзакции = "Отменена";
				Иначе
					Стр.СтатусТранзакции = "";
				КонецЕсли;
				Если ТипЗнч(Стр.Данные) = Тип("Структура")
					ИЛИ ТипЗнч(Стр.Данные) = Тип("Соответствие") Тогда
					ПредставлениеДанныхСтрокой = "";
					Для Каждого ЭлСтруктуры Из Стр.Данные Цикл
						ПредставлениеДанныхСтрокой = ПредставлениеДанныхСтрокой + 
							ЭлСтруктуры.Ключ + ": " + ЭлСтруктуры.Значение + ";" + Символы.ПС;
					КонецЦикла;
					Стр.Данные = ПредставлениеДанныхСтрокой;
				ИначеЕсли ТипЗнч(Стр.Данные) = Тип("Массив") Тогда
					ПредставлениеДанныхСтрокой = "";
					Для Каждого ЭлМассива Из Стр.Данные Цикл
						ПредставлениеДанныхСтрокой = ПредставлениеДанныхСтрокой + 
							ЭлМассива + ";" + Символы.ПС;
					КонецЦикла;
					Стр.Данные = ПредставлениеДанныхСтрокой;
				КонецЕсли;
				Стр.ДанныеСтрокой = Строка(Стр.Данные);
				
				Стр.МоментВремени = 
					(Стр.Дата - Дата(1,1,1))
					* 1000
					+ НомерОбрабатываемойСтроки;				
				НомерОбрабатываемойСтроки = НомерОбрабатываемойСтроки + 1;
			КонецЦикла;
						
			Если ЭтотОбъект.КэшироватьДанные Тогда
				ЭтотОбъект.КэшЖурналаРегистрации.Загрузить(ТабЖур);	
			КонецЕсли;
			
		Иначе
			ТабЖур = ЭтотОбъект.КэшЖурналаРегистрации.Выгрузить();
		КонецЕсли;
	Иначе
		ТабЖур = ЭтотОбъект.КэшЖурналаРегистрации.Выгрузить();	
	КонецЕсли;
	
	Если ЭтотОбъект.КэшПользователейИнформационнойБазы.Количество() = 0 Тогда
		СписокПользователейИБ = ПользователиИнформационнойБазы.ПолучитьПользователей();
		Для Каждого ПользовательИБ из СписокПользователейИБ Цикл
			НовСтрПользовательИБ = КэшПользователейИнформационнойБазы.Добавить();
			НовСтрПользовательИБ.Имя = ПользовательИБ.Имя;
			НовСтрПользовательИБ.ПолноеИмя = ПользовательИБ.ПолноеИмя;
			НовСтрПользовательИБ.УникальныйИдентификатор = ПользовательИБ.УникальныйИдентификатор;
		КонецЦикла;
	КонецЕсли;
	
	Если НЕ РежимФормированияОтчета = "ТолькоЖурналРегистацииОтчет" Тогда
				
		ДанныеРасшифровки = Новый ДанныеРасшифровкиКомпоновкиДанных; 
		КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;  
		
		СхемаКомпоновкиДанных = ПолучитьМакет("ОсновнаяСхемаКомпоновкиДанных");		
		Если ЭтотОбъект.ИспользуетсяБСП Тогда
			
			СхемаКомпоновкиДанных.НаборыДанных.СправочникПользователи.Запрос =
				"ВЫБРАТЬ
				|	Пользователи.Ссылка КАК Ссылка,
				|	Пользователи.ИдентификаторПользователяИБ
				|ИЗ
				|	Справочник.Пользователи КАК Пользователи";
			
			Для Каждого ПолеЗапроса Из СхемаКомпоновкиДанных.НаборыДанных.СправочникПользователи.Поля Цикл
				
				Если ТипЗнч(ПолеЗапроса) = Тип("ПолеНабораДанныхСхемыКомпоновкиДанных")
					И Строка(ПолеЗапроса.Поле) = "Ссылка" Тогда
					ПолеЗапроса.ТипЗначения = Новый ОписаниеТипов("СправочникСсылка.Пользователи");	
				КонецЕсли;
				
			КонецЦикла;
			
		Иначе
			
			СхемаКомпоновкиДанных.НаборыДанных.СправочникПользователи.Запрос =
				"ВЫБРАТЬ
				|	НЕОПРЕДЕЛЕНО КАК Ссылка,
				|	НЕОПРЕДЕЛЕНО КАК ИдентификаторПользователяИБ";
			
		КонецЕсли;		
		МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, Настройки, ДанныеРасшифровки);
		
		ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
		ПроцессорКомпоновки.Инициализировать(МакетКомпоновки,
			Новый Структура("ТабЖур, ПользователиИБ", ТабЖур, ЭтотОбъект.КэшПользователейИнформационнойБазы.Выгрузить()), 
			ДанныеРасшифровки);
		
		ДокументРезультат.Очистить();
		
		ВывестиИнформациюОФильтрахЖурналаРегистрации(ДокументРезультат);
		
		ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
		ПроцессорВывода.УстановитьДокумент(ДокументРезультат);	
		ПроцессорВывода.Вывести(ПроцессорКомпоновки);
		
	КонецЕсли;
	
	ИнициализацияДоступныхЗначенийОтборовЖурналаРегистрации();
	
	ДатаЗавершенияВыполненияОперации = ТекущаяДата();	
	ЭтотОбъект.ВремяВыполненияПоследнейОперации = ДатаЗавершенияВыполненияОперации - ДатаНачалаВыполненияОперации;
	
КонецПроцедуры

#КонецОбласти

#Область РаботаС_СКД

Функция ПолучитьДоступныеПоляОтбора(НастройкиКомпоновщика, ИмяЭлементаОтбора)
	
	ПолеОтбора = НастройкиКомпоновщика.Отбор.ДоступныеПоляОтбора.Элементы.Найти(ИмяЭлементаОтбора);
	Если ПолеОтбора = Неопределено Тогда
		Возврат Неопределено;	
	Иначе
		Возврат ПолеОтбора.ДоступныеЗначения;
	КонецЕсли;
	
КонецФункции

Функция ПолучитьДоступныеПоляПараметра(НастройкиКомпоновщика, ИмяЭлементаПараметра)
	
	ПолеОтбора = НастройкиКомпоновщика.ПараметрыДанных.ДоступныеПараметры.Элементы.Найти(ИмяЭлементаПараметра);
	Если ПолеОтбора = Неопределено Тогда
		Возврат Неопределено;	
	Иначе
		Возврат ПолеОтбора.ДоступныеЗначения;
	КонецЕсли;   
	
КонецФункции

Функция ОбновитьДоступныеЗначенияОтборов() Экспорт
	
	Отчет = ЭтотОбъект;
	
	МассивОбрабатываемыхВидовНастроек = Новый Массив;
	МассивОбрабатываемыхВидовНастроек.Добавить("Настройки");
		
	Для Каждого ВидНастройки Из МассивОбрабатываемыхВидовНастроек Цикл
		
		ТекущиеНастройкиСКД = Отчет.КомпоновщикНастроек[ВидНастройки];
		ТекущиеНастройкиОтборов = ТекущиеНастройкиСКД.Отбор;
		ТекущиеДоступныеПоляОтборов = ТекущиеНастройкиОтборов.ДоступныеПоляОтбора.Элементы;
		
		// Имя приложения
		ПолеОтбора = ТекущиеДоступныеПоляОтборов.Найти("ИмяПриложения");
		СписокОтбор = Новый СписокЗначений;
		Для Каждого Эл Из Отчет.КэшДоступныхЗначенийОтборов.ИмяПриложения Цикл
			СписокОтбор.Добавить(Эл.Ключ, Эл.Значение);
		КонецЦикла;
		ПолеОтбора.ДоступныеЗначения = СписокОтбор;
		
		// Уровень журнала регистрации
		ПолеОтбора = ТекущиеДоступныеПоляОтборов.Найти("Уровень");
		СписокОтбор = Новый СписокЗначений;
		Для Каждого Эл Из Отчет.КэшДоступныхЗначенийОтборов.Уровень Цикл
			СписокОтбор.Добавить(Эл.Значение, Эл.Представление);
		КонецЦикла;
		ПолеОтбора.ДоступныеЗначения = СписокОтбор;
		
		// Имя пользователя
		ПолеОтбора = ТекущиеДоступныеПоляОтборов.Найти("ИмяПользователя");
		СписокИменПриложенийОтбор = Новый СписокЗначений;
		Для Каждого Эл Из Отчет.КэшДоступныхЗначенийОтборов.Пользователь Цикл
			СписокИменПриложенийОтбор.Добавить(Эл.Значение, Эл.Значение);
		КонецЦикла;
		ПолеОтбора.ДоступныеЗначения = СписокИменПриложенийОтбор;
		
		// Пользователь
		ПолеОтбора = ТекущиеДоступныеПоляОтборов.Найти("Пользователь");
		СписокОтбор = Новый СписокЗначений;
		Для Каждого Эл Из Отчет.КэшДоступныхЗначенийОтборов.Пользователь Цикл
			СписокОтбор.Добавить(Эл.Ключ, Эл.Значение);
		КонецЦикла;
		ПолеОтбора.ДоступныеЗначения = СписокОтбор;
		
		// Компьютер
		ПолеОтбора = ТекущиеДоступныеПоляОтборов.Найти("Компьютер");
		СписокОтбор = Новый СписокЗначений;
		Для Каждого Эл Из Отчет.КэшДоступныхЗначенийОтборов.Компьютер Цикл
			СписокОтбор.Добавить(Эл, Эл);
		КонецЦикла;
		ПолеОтбора.ДоступныеЗначения = СписокОтбор;
		
		// Событие
		ПолеОтбора = ТекущиеДоступныеПоляОтборов.Найти("Событие");
		СписокОтбор = Новый СписокЗначений;
		Для Каждого Эл Из Отчет.КэшДоступныхЗначенийОтборов.Событие Цикл
			СписокОтбор.Добавить(Эл.Ключ, Эл.Значение);
		КонецЦикла;
		ПолеОтбора.ДоступныеЗначения = СписокОтбор;
		
		// Метаданные
		ПолеОтбора = ТекущиеДоступныеПоляОтборов.Найти("Метаданные");
		СписокОтбор = Новый СписокЗначений;
		Для Каждого Эл Из Отчет.КэшДоступныхЗначенийОтборов.Метаданные Цикл
			СписокОтбор.Добавить(Эл.Ключ, Эл.Значение);
		КонецЦикла;
		ПолеОтбора.ДоступныеЗначения = СписокОтбор;
		
		// Статус транзакции
		ПолеОтбора = ТекущиеДоступныеПоляОтборов.Найти("СтатусТранзакции");
		СписокОтбор = Новый СписокЗначений;
		Для Каждого Эл Из Отчет.КэшДоступныхЗначенийОтборов.СтатусТранзакции Цикл
			СписокОтбор.Добавить(Эл.Ключ, Эл.Значение);
		КонецЦикла;
		ПолеОтбора.ДоступныеЗначения = СписокОтбор;

		// Рабочий сервер
		ПолеОтбора = ТекущиеДоступныеПоляОтборов.Найти("РабочийСервер");
		СписокОтбор = Новый СписокЗначений;
		Для Каждого Эл Из Отчет.КэшДоступныхЗначенийОтборов.РабочийСервер Цикл
			СписокОтбор.Добавить(Эл, Эл);
		КонецЦикла;
		ПолеОтбора.ДоступныеЗначения = СписокОтбор;

		// Основной IP-порт
		ПолеОтбора = ТекущиеДоступныеПоляОтборов.Найти("ОсновнойIPПорт");
		СписокОтбор = Новый СписокЗначений;
		Для Каждого Эл Из Отчет.КэшДоступныхЗначенийОтборов.ОсновнойIPПорт Цикл
			СписокОтбор.Добавить(Эл, Эл);
		КонецЦикла;
		ПолеОтбора.ДоступныеЗначения = СписокОтбор;
		
		// Вспомогательный IP-порт
		ПолеОтбора = ТекущиеДоступныеПоляОтборов.Найти("ВспомогательныйIPПорт");
		СписокОтбор = Новый СписокЗначений;
		Для Каждого Эл Из Отчет.КэшДоступныхЗначенийОтборов.ВспомогательныйIPПорт Цикл
			СписокОтбор.Добавить(Эл, Эл);
		КонецЦикла;
		ПолеОтбора.ДоступныеЗначения = СписокОтбор;

	КонецЦикла;
	
КонецФункции

Процедура ВывестиИнформациюОФильтрахЖурналаРегистрации(ТабличныйДокументРезультат)
	
	ДанныеОФильтрахЖурнала = ПолучитьМакет("ИнформацияФильтрыЖурналаРегистрации");		
	
	//ТабличныйДокументРезультат = Новый ТабличныйДокумент;

	Область_НастройкиФильтровЖурналаРегистрации = ДанныеОФильтрахЖурнала.ПолучитьОбласть("НастройкиФильтровЖурналаРегистрации");
	
	#Область ОсновныеНастройки
	Область_Заголовок = Область_НастройкиФильтровЖурналаРегистрации.ПолучитьОбласть("Заголовок");
	ТабличныйДокументРезультат.Вывести(Область_Заголовок);
	ТабличныйДокументРезультат.НачатьГруппуСтрок("НастройкиФильтровЖурналаРегистрации", Истина);
	
	Область_ИсточникЖурналарегистрации = Область_НастройкиФильтровЖурналаРегистрации.ПолучитьОбласть("ИсточникЖурналаРегистрации");
	Если ЗначениеЗаполнено(ЭтотОбъект.ПутьКФайлуЖурналаРегистрации) Тогда
		Область_ИсточникЖурналарегистрации.Параметры.ИсточникЖурналаРегистрации = ЭтотОбъект.ПутьКФайлуЖурналаРегистрации;
	Иначе
		Область_ИсточникЖурналарегистрации.Параметры.ИсточникЖурналаРегистрации = "текущей информационной базы";
	КонецЕсли;
	ТабличныйДокументРезультат.Вывести(Область_ИсточникЖурналарегистрации);
	
	Область_Период = Область_НастройкиФильтровЖурналаРегистрации.ПолучитьОбласть("Период");
	Область_Период.Параметры.НачалоПериода = ?(ЗначениеЗаполнено(ЭтотОбъект.НачалоПериода), ЭтотОбъект.НачалоПериода, "<не задано>");
	Область_Период.Параметры.КонецПериода = ?(ЗначениеЗаполнено(ЭтотОбъект.КонецПериода), ЭтотОбъект.КонецПериода, "<не задано>");;
	ТабличныйДокументРезультат.Вывести(Область_Период);
	
	Если ЭтотОбъект.КолонкиЖурналаРегистрации.Количество() > 0
		И НЕ ЭтотОбъект.КолонкиЖурналаРегистрации.Количество() = ЭтотОбъект.КэшДоступныхЗначенийОтборов.КолонкиЖурналаРегистрации.Количество() Тогда
		Область_Колонки = Область_НастройкиФильтровЖурналаРегистрации.ПолучитьОбласть("Колонки");
		Область_Колонки.Параметры.КолонкиЖурналаРегистрации = СписокЗначенийВСтроку(ЭтотОбъект.КолонкиЖурналаРегистрации);
		ТабличныйДокументРезультат.Вывести(Область_Колонки);
	КонецЕсли;
	Если ЗначениеЗаполнено(ЭтотОбъект.МаксимальноеКоличествоЗаписей) Тогда
		Область_КоличествоВыбираемыхЗаписей = Область_НастройкиФильтровЖурналаРегистрации.ПолучитьОбласть("КоличествоВыбираемыхЗаписей");
		Область_КоличествоВыбираемыхЗаписей.Параметры.МаксимальноеКоличествоЗаписей = ЭтотОбъект.МаксимальноеКоличествоЗаписей;
		ТабличныйДокументРезультат.Вывести(Область_КоличествоВыбираемыхЗаписей);
	КонецЕсли;
	
	#КонецОбласти
	
	#Область ОсновныеСвойства
	ЕстьФильтрПоПользователям = ЭтотОбъект.Пользователи.Количество() > 0;
	ЕстьСобытия = ЭтотОбъект.События.Количество() > 0;
	ЕстьКомпьютеры = ЭтотОбъект.Компьютеры.Количество() > 0;
	ЕстьПриложения = ЭтотОбъект.Приложения.Количество() > 0;
	ЕстьКомментарий = ЗначениеЗаполнено(ЭтотОбъект.Комментарий);
	ЕстьВажность = ЭтотОбъект.Важность.Количество() > 0;
	Если ЕстьФильтрПоПользователям
		ИЛИ ЕстьСобытия
		ИЛИ ЕстьКомпьютеры 
		ИЛИ ЕстьПриложения
		ИЛИ ЕстьКомментарий
		ИЛИ ЕстьВажность Тогда
		
		Область_Заголовок_ОсновныеСвойства = Область_НастройкиФильтровЖурналаРегистрации.ПолучитьОбласть("Заголовок_ОсновныеСвойства");
		ТабличныйДокументРезультат.Вывести(Область_Заголовок_ОсновныеСвойства);
		ТабличныйДокументРезультат.НачатьГруппуСтрок("ОсновныеСвойства", Ложь);
		
		Если ЕстьФильтрПоПользователям Тогда
			Область_Пользователи = Область_НастройкиФильтровЖурналаРегистрации.ПолучитьОбласть("Пользователи");
			Область_Пользователи.Параметры.Пользователи = СписокЗначенийВСтроку(ЭтотОбъект.Пользователи);
			ТабличныйДокументРезультат.Вывести(Область_Пользователи);
		КонецЕсли;
		
		Если ЕстьСобытия Тогда
			Область_События = Область_НастройкиФильтровЖурналаРегистрации.ПолучитьОбласть("События");
			Область_События.Параметры.События = СписокЗначенийВСтроку(ЭтотОбъект.События);
			ТабличныйДокументРезультат.Вывести(Область_События);
		КонецЕсли;
		
		Если ЕстьКомпьютеры Тогда
			Область_Компьютеры = Область_НастройкиФильтровЖурналаРегистрации.ПолучитьОбласть("Компьютеры");
			Область_Компьютеры.Параметры.Компьютеры = СписокЗначенийВСтроку(ЭтотОбъект.Компьютеры);
			ТабличныйДокументРезультат.Вывести(Область_Компьютеры);
		КонецЕсли;
		
		Если ЕстьПриложения Тогда
			Область_Приложения = Область_НастройкиФильтровЖурналаРегистрации.ПолучитьОбласть("Приложения");
			Область_Приложения.Параметры.Приложения = СписокЗначенийВСтроку(ЭтотОбъект.Приложения);
			ТабличныйДокументРезультат.Вывести(Область_Приложения);
		КонецЕсли;
		
		Если ЕстьКомментарий Тогда
			Область_Комментарий = Область_НастройкиФильтровЖурналаРегистрации.ПолучитьОбласть("Комментарий");
			Область_Комментарий.Параметры.Комментарий = ЭтотОбъект.Комментарий;
			ТабличныйДокументРезультат.Вывести(Область_Комментарий);
		КонецЕсли;
		
		Если ЕстьВажность Тогда
			Область_Важность = Область_НастройкиФильтровЖурналаРегистрации.ПолучитьОбласть("Важность");
			Область_Важность.Параметры.Важность = СписокЗначенийВСтроку(ЭтотОбъект.Важность);
			ТабличныйДокументРезультат.Вывести(Область_Важность);
		КонецЕсли;
		
		ТабличныйДокументРезультат.ЗакончитьГруппуСтрок();
		
	КонецЕсли;
	#КонецОбласти
	
	#Область Данные
	ЕстьМетаданные = ЭтотОбъект.ФильтрМетаданные.Количество() > 0;
	ЕстьДанные = ЗначениеЗаполнено(ЭтотОбъект.Данные);
	ЕстьПредставлениеДанных = ЗначениеЗаполнено(ЭтотОбъект.ПредставлениеДанных);
	Если ЕстьМетаданные
		ИЛИ ЕстьДанные
		ИЛИ ЕстьПредставлениеДанных Тогда
		
		Область_Заголовок_Данные = Область_НастройкиФильтровЖурналаРегистрации.ПолучитьОбласть("Заголовок_Данные");
		ТабличныйДокументРезультат.Вывести(Область_Заголовок_Данные);
		ТабличныйДокументРезультат.НачатьГруппуСтрок("Данные", Ложь);
		
		Если ЕстьМетаданные Тогда
			Область_Метаданные = Область_НастройкиФильтровЖурналаРегистрации.ПолучитьОбласть("Метаданные");
			Область_Метаданные.Параметры.ФильтрМетаданные = СписокЗначенийВСтроку(ЭтотОбъект.ФильтрМетаданные);
			ТабличныйДокументРезультат.Вывести(Область_Метаданные);
		КонецЕсли;
		
		Если ЕстьДанные Тогда
			Область_Данные = Область_НастройкиФильтровЖурналаРегистрации.ПолучитьОбласть("Данные");
			Область_Данные.Параметры.Данные = ЭтотОбъект.Данные;
			ТабличныйДокументРезультат.Вывести(Область_Данные);
		КонецЕсли;
		
		Если ЕстьПредставлениеДанных Тогда
			Область_ПредставлениеДанных = Область_НастройкиФильтровЖурналаРегистрации.ПолучитьОбласть("ПредставлениеДанных");
			Область_ПредставлениеДанных.Параметры.ПредставлениеДанных = ЭтотОбъект.ПредставлениеДанных;
			ТабличныйДокументРезультат.Вывести(Область_ПредставлениеДанных);
		КонецЕсли;
				
		ТабличныйДокументРезультат.ЗакончитьГруппуСтрок();
		
	КонецЕсли;
	#КонецОбласти
	
	#Область Транзакции
	ЕстьТранзакции = ЗначениеЗаполнено(ЭтотОбъект.Транзакция);
	ЕстьСтатусТранзакции = ЗначениеЗаполнено(ЭтотОбъект.СтатусТранзакции);
	Если ЕстьТранзакции
		ИЛИ ЕстьСтатусТранзакции Тогда
		
		Область_Заголовок_Транзакции = Область_НастройкиФильтровЖурналаРегистрации.ПолучитьОбласть("Заголовок_Транзакции");
		ТабличныйДокументРезультат.Вывести(Область_Заголовок_Транзакции);
		ТабличныйДокументРезультат.НачатьГруппуСтрок("Транзакции", Ложь);
		
		Если ЕстьТранзакции Тогда
			Область_Транзакция = Область_НастройкиФильтровЖурналаРегистрации.ПолучитьОбласть("Транзакция");
			Область_Транзакция.Параметры.Транзакция = ЭтотОбъект.Транзакция;
			ТабличныйДокументРезультат.Вывести(Область_Транзакция);
		КонецЕсли;
		
		Если ЕстьСтатусТранзакции Тогда
			Область_СтатусТранзакции = Область_НастройкиФильтровЖурналаРегистрации.ПолучитьОбласть("СтатусТранзакции");
			Область_СтатусТранзакции.Параметры.СтатусТранзакции = ЭтотОбъект.СтатусТранзакции;
			ТабличныйДокументРезультат.Вывести(Область_СтатусТранзакции);
		КонецЕсли;
						
		ТабличныйДокументРезультат.ЗакончитьГруппуСтрок();
		
	КонецЕсли;
	#КонецОбласти
	
	#Область СеансыИСерверы
	ЕстьСеансы = ЭтотОбъект.Сеансы.Количество() > 0;
	ЕстьРабочиеСерверы = ЭтотОбъект.РабочиеСерверы.Количество() > 0;
	ЕстьОсновныеIPПорты = ЭтотОбъект.ОсновныеIPПорты.Количество() > 0;
	ЕстьВспомогательныеIPПОрты = ЭтотОбъект.ВспомогательныеIPПОрты.Количество() > 0;
	Если ЕстьСеансы
		ИЛИ ЕстьРабочиеСерверы
		ИЛИ ЕстьОсновныеIPПорты
		ИЛИ ЕстьВспомогательныеIPПОрты Тогда
		
		Область_Заголовок_СеансыИСерверы = Область_НастройкиФильтровЖурналаРегистрации.ПолучитьОбласть("Заголовок_СеансыИСерверы");
		ТабличныйДокументРезультат.Вывести(Область_Заголовок_СеансыИСерверы);
		ТабличныйДокументРезультат.НачатьГруппуСтрок("СеансыИСерверы", Ложь);
		
		Если ЕстьСеансы Тогда
			Область_Сеансы = Область_НастройкиФильтровЖурналаРегистрации.ПолучитьОбласть("Сеансы");
			Область_Сеансы.Параметры.Сеансы = СписокЗначенийВСтроку(ЭтотОбъект.Сеансы);
			ТабличныйДокументРезультат.Вывести(Область_Сеансы);
		КонецЕсли;
		
		Если ЕстьРабочиеСерверы Тогда
			Область_РабочиеСерверы = Область_НастройкиФильтровЖурналаРегистрации.ПолучитьОбласть("РабочиеСерверы");
			Область_РабочиеСерверы.Параметры.РабочиеСерверы = ЭтотОбъект.РабочиеСерверы;
			ТабличныйДокументРезультат.Вывести(Область_РабочиеСерверы);
		КонецЕсли;
		
		Если ЕстьОсновныеIPПорты Тогда
			Область_ОсновныеIPПорты = Область_НастройкиФильтровЖурналаРегистрации.ПолучитьОбласть("ОсновныеIPПорты");
			Область_ОсновныеIPПорты.Параметры.ОсновныеIPПорты = ЭтотОбъект.ОсновныеIPПорты;
			ТабличныйДокументРезультат.Вывести(Область_ОсновныеIPПорты);
		КонецЕсли;

		Если ЕстьВспомогательныеIPПОрты Тогда
			Область_ВспомогательныеIPПОрты = Область_НастройкиФильтровЖурналаРегистрации.ПолучитьОбласть("ВспомогательныеIPПОрты");
			Область_ВспомогательныеIPПОрты.Параметры.ВспомогательныеIPПОрты = ЭтотОбъект.ВспомогательныеIPПОрты;
			ТабличныйДокументРезультат.Вывести(Область_ВспомогательныеIPПОрты);
		КонецЕсли;
						
		ТабличныйДокументРезультат.ЗакончитьГруппуСтрок();
		
	КонецЕсли;
	#КонецОбласти
	
	ТабличныйДокументРезультат.ЗакончитьГруппуСтрок();
	
КонецПроцедуры

#КонецОбласти

#Область РаботаСЖурналомРегистрации

Процедура ПолучитьДанныеЖурналаРегистрации(ТабЖур, ПодготовленныйФильтрЖурналаРегистрации, КолонкиСтрокой, МаксимальноеКоличествоЗаписей)
	
	ВыгрузитьЖурналРегистрации(ТабЖур, ПодготовленныйФильтрЖурналаРегистрации, КолонкиСтрокой, ПутьКФайлуЖурналаРегистрации, МаксимальноеКоличествоЗаписей);
	
КонецПроцедуры

Функция ПолучитьДоступныеЗначенияОтборовЖурналаРегистрации() Экспорт
	
	КолонкиОтбора = "Пользователь, Компьютер, ИмяПриложения, Событие,"+
		"Метаданные, РабочийСервер, ОсновнойIPПорт, ВспомогательныйIPПорт";
		
	// TODO:
	// На будущее для реализации отборов по разделяемым данны.
	//КолонкиОтбораРазделенияДанных = "РазделениеДанныхСеанса";
	//Для Каждого РеквизитРазделения Из Метаданные.ОбщиеРеквизиты Цикл
	//	Если РеквизитРазделения.РазделениеДанных = Метаданные.СвойстваОбъектов.РазделениеДанныхОбщегоРеквизита.Разделять Тогда
	//		КолонкиОтбораРазделенияДанных = КолонкиОтбораРазделенияДанных +
	//			", РазделениеДанныхСеанса." + РеквизитРазделения.Имя;
	//	КонецЕсли;
	//КонецЦикла;
	//КолонкиОтбора = КолонкиОтбора + ", " + КолонкиОтбораРазделенияДанных;
	
	Попытка
		Возврат ПолучитьЗначенияОтбораЖурналаРегистрации(КолонкиОтбора, ПутьКФайлуЖурналаРегистрации);
	Исключение
		Сообщить(
			"Не удалось прочитать файл журнала регистрации: """+ПутьКФайлуЖурналаРегистрации+"""
			|Источник формирования отчета сброшен на внутренний журнал регистрации!
			|
			|Причина:
			|" + ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		ПутьКФайлуЖурналаРегистрации = Неопределено;
		Возврат ПолучитьЗначенияОтбораЖурналаРегистрации(КолонкиОтбора);
	КонецПопытки;
	
КонецФункции

Функция ПодготовитьНастройкиФильтраДляПолученияДанныхЖурналарегистрации(Знач ИсходноеЗначение)
	
	НовоеЗначение = Новый Структура;
	Для Каждого Эл ИЗ ИсходноеЗначение Цикл
		Если ТипЗнч(Эл.Значение) = Тип("Массив") Тогда
			ПреобразованныйМассив = Новый Массив;
			Для Каждого ИсходноеЗначениеМассива Из Эл.Значение Цикл
				Если Эл.Ключ = "Уровень" Тогда			
					ПреобразованныйМассив.Добавить(ПредопределенноеЗначение("УровеньЖурналаРегистрации."+ИсходноеЗначениеМассива));
				ИначеЕсли Эл.Ключ = "СтатусТранзакции" Тогда
					ПреобразованныйМассив.Добавить(ПредопределенноеЗначение("СтатусТранзакцииЗаписиЖурналаРегистрации."+ИсходноеЗначениеМассива));
				Иначе
					ПреобразованныйМассив.Добавить(ИсходноеЗначениеМассива);	
				КонецЕсли;
			КонецЦикла;
			НовоеЗначение.Вставить(Эл.Ключ, ПреобразованныйМассив);
		Иначе
			НовоеЗначение.Вставить(Эл.Ключ, Эл.Значение);	
		КонецЕсли;
	КонецЦикла;
	
	Возврат НовоеЗначение;
	
КонецФункции

#КонецОбласти

#Область Служебные

Функция РазбитьСтроку(ИсходнаяСтрока,Разделитель)
	
	Рез = Новый Массив;
	
	Строки = СтрЗаменить(ИсходнаяСтрока,Разделитель,Символы.ПС);
	
	Для Ном = 1 По СтрЧислоСтрок(Строки) Цикл
		Рез.Добавить(СтрПолучитьСтроку(Строки,Ном));
	КонецЦикла;
	
	Возврат Рез;
	
КонецФункции  

Функция ПреобразоватьКЧислу(ЧислоСтрока)
	
	Попытка 
		Возврат Число(ЧислоСтрока);
	Исключение
		Возврат Неопределено;
	КонецПопытки;
	
КонецФункции

Функция СписокЗначенийВСтроку(СписокЗначений)
	
	ЗначениеСтрокой = "";
	
	Для Каждого Эл Из СписокЗначений Цикл
		
		ЗначениеСтрокой = ЗначениеСтрокой + 
			?(СписокЗначений.Индекс(Эл) = 0, "", "; ") +
			?(ЗначениеЗаполнено(Эл.Представление), Эл.Представление, Эл.Значение);			
		
	КонецЦикла;
	
	Возврат ЗначениеСтрокой;
	
КонецФункции

Функция ПеременнаяСодержитСвойство(Переменная, ИмяСвойства)
	
	GUIDПроверка = Новый УникальныйИдентификатор;
	СтруктураПроверка = Новый Структура;
	СтруктураПроверка.Вставить(ИмяСвойства, GUIDПроверка);
	
	ЗаполнитьЗначенияСвойств(СтруктураПроверка, Переменная);
	
	Если СтруктураПроверка[ИмяСвойства] = GUIDПроверка Тогда
		Возврат Ложь;
	Иначе
		Возврат Истина;
	КонецЕсли;
	
КонецФункции

Функция ОбщийМодуль(Имя)
	
	Если Метаданные.ОбщиеМодули.Найти(Имя) <> Неопределено Тогда
		Модуль = Вычислить(Имя);
	Иначе
		Модуль = Неопределено;
	КонецЕсли;
		
	Возврат Модуль;
	
КонецФункции

#КонецОбласти

Инициализация();
