
#Область ОписаниеПеременных

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	
	
КонецПроцедуры

&НаСервере
Процедура ПриСохраненииДанныхВНастройкахНаСервере(Настройки)
	
	
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы



#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СформироватьСкрипт(Команда)
	
	СтраницаСкрипта = Элементы.ГруппаСкриптыПоШагам.ТекущаяСтраница;
	
	Если СтраницаСкрипта = Элементы.ГруппаСкриптСозданияБазыДанных Тогда
		СформироватьСкриптСозданияБазыДанных();
	ИначеЕсли СтраницаСкрипта = Элементы.ГруппаСкриптУдаленияУстаревшихОбъектов Тогда
		СформироватьСкриптУдаленияВсехОбъектовПредыдущейВерсии();
	ИначеЕсли СтраницаСкрипта = Элементы.ГруппаСкриптПодготовкиТаблиц Тогда
		СформироватьСкриптПереносаТаблицИДанных();
	ИначеЕсли СтраницаСкрипта = Элементы.ГруппаСкриптПодготовкиПредставлений Тогда
		СформироватьСкриптСозданияПредставлений();	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьНастройкиОбъектовБазыПоУмолчанию(Команда)
	
	Состояние("Заполнение настройки объектов базы данных...");
	
	ЗаполнитьНастройкиОбъектовБазыПоУмолчаниюНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьПодключениеКИсходнойБазеДанных(Команда)
	
	Состояние("Выполняется проверка подключения...");
			
	РезультатПроверки = ПроверитьПодключениеКИсходнойБазеДанныхНаСервере();
	Если РезультатПроверки Тогда
		ПоказатьПредупреждение(Неопределено, "Соединение успешно установлено!");
	Иначе
		ПоказатьПредупреждение(Неопределено, "Не удалось установить соединение!");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьПодключениеКАдаптированнойБазеДанных(Команда)
	
	Состояние("Выполняется проверка подключения...");
			
	РезультатПроверки = ПроверитьПодключениеКАдаптированнойБазеДанныхНаСервере();
	Если РезультатПроверки Тогда
		ПоказатьПредупреждение(Неопределено, "Соединение успешно установлено!");
	Иначе
		ПоказатьПредупреждение(Неопределено, "Не удалось установить соединение!");
	КонецЕсли;	
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура СформироватьСкриптСозданияБазыДанных()
	
	ОбъектНаСервере = РеквизитФормыВЗначение("Объект");
	ОбъектНаСервере.СформироватьСкриптСозданияБазыДанных();
	ЗначениеВРеквизитФормы(ОбъектНаСервере, "Объект");
	
КонецПроцедуры

&НаСервере
Процедура СформироватьСкриптУдаленияВсехОбъектовПредыдущейВерсии()
	
	ОбъектНаСервере = РеквизитФормыВЗначение("Объект");
	ОбъектНаСервере.СформироватьСкриптУдаленияВсехОбъектовПредыдущейВерсии();
	ЗначениеВРеквизитФормы(ОбъектНаСервере, "Объект");
	
КонецПроцедуры

&НаСервере
Процедура СформироватьСкриптПереносаТаблицИДанных()
	
	ОбъектНаСервере = РеквизитФормыВЗначение("Объект");
	ОбъектНаСервере.СформироватьСкриптПереносаТаблицИДанных();
	ЗначениеВРеквизитФормы(ОбъектНаСервере, "Объект");
	
КонецПроцедуры

&НаСервере
Процедура СформироватьСкриптСозданияПредставлений()
	
	ОбъектНаСервере = РеквизитФормыВЗначение("Объект");
	ОбъектНаСервере.СформироватьСкриптСозданияПредставлений();
	ЗначениеВРеквизитФормы(ОбъектНаСервере, "Объект");
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНастройкиОбъектовБазыПоУмолчаниюНаСервере()
	
	ОбъектНаСервере = РеквизитФормыВЗначение("Объект");
	ОбъектНаСервере.ЗаполнитьНастройкиОбъектовБазыПоУмолчанию();
	ЗначениеВРеквизитФормы(ОбъектНаСервере, "Объект");
	
КонецПроцедуры

Функция ПроверитьПодключениеКИсходнойБазеДанныхНаСервере()
	
	ОбъектНаСервере = РеквизитФормыВЗначение("Объект");
	РезультатПроверки = ОбъектНаСервере.ПроверитьПодключениеКИсходнойКопииБазыДанных();
	
	Возврат РезультатПроверки;
	
КонецФункции

Функция ПроверитьПодключениеКАдаптированнойБазеДанныхНаСервере()
	
	ОбъектНаСервере = РеквизитФормыВЗначение("Объект");
	РезультатПроверки = ОбъектНаСервере.ПроверитьПодключениеКАдаптированнойБазеДанных();
	
	Возврат РезультатПроверки;
	
КонецФункции

#КонецОбласти
